[
  {
       "title": "Linda McMahon to step down as head of Small Business Administration, source says - Fox News",
       "summary": "Small Business Administrator Linda McMahon is expected to resign from President Trump’s Cabinet, a source familiar with her plans confirmed to Fox News Friday.",
       "publishedDate": "2019-03-29T19:29:21Z",
       "content": "Small Business Administrator Linda McMahon is expected to resign from President Trump’s Cabinet, a source familiar with her plans confirmed to Fox News on Friday. The source told Fox News that McMahon is expected to join the Trump-affiliated America First Act… [+995 chars]",
       "link": "https://www.foxnews.com/politics/linda-mcmahon-to-step-down-as-head-of-small-business-administration-source-says",
       "imageURL": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png"
  },
  {
       "title": "Apple cancels AirPower product, citing inability to meet its high standards for hardware - TechCrunch",
       "summary": "Apple has canceled the AirPower product completely, citing difficulty meeting its own standards. “After much effort, we’ve concluded AirPower will not achieve our high standards and we have cancelled the project. We apologize to those customers who were looki…",
       "publishedDate": "2019-03-29T19:14:44Z",
       "content": "Apple has canceled the AirPower product completely, citing difficulty meeting its own standards. After much effort, weve concluded AirPower will not achieve our high standards and we have cancelled the project. We apologize to those customers who were looking… [+3320 chars]",
       "link": "https://techcrunch.com/2019/03/29/apple-cancels-airpower-product-citing-inability-to-meet-its-high-standards-for-hardware/",
       "imageURL": "https://techcrunch.com/wp-content/uploads/2019/03/dims1.jpg?w=600"
  },
  {
       "title": "Spacewalking Astronauts Replace Old Batteries on Space Station - Space.com",
       "summary": "The space station's big power upgrade is now halfway done.",
       "publishedDate": "2019-03-29T18:54:00Z",
       "content": "NASA astronauts Nick Hague and Christina Koch successfully completed a spacewalk at the International Space Station today to continue an ongoing power upgrade at the orbiting lab. The spacewalkers spent 6 hours and 45 minutes working to replace a set of old n… [+8108 chars]",
       "link": "https://www.space.com/spacewalking-astronauts-replace-old-station-batteries-exp59.html",
       "imageURL": "https://cdn.mos.cms.futurecdn.net/jnLFhJzciGrAsowkLwMAsg-1200-80.jpg"
  },
  {
       "title": "Scientists Find Fossilized Fish That May Have Been Blasted by Debris From Asteroid That Ended the Dinosaur Age - Gizmodo",
       "summary": "At one of the most important ancient graveyards on Earth in North Dakota, paleontologists unearthed the fossilized remains of fish seemingly killed by the effects of the asteroid that ended the Cretaceous.",
       "publishedDate": "2019-03-29T18:20:00Z",
       "content": "At one of the most important ancient graveyards on Earth in North Dakota, paleontologists unearthed the fossilized remains of fish seemingly killed by the effects of the asteroid that ended the Cretaceous. We know that a large asteroid struck the Earth 66 mil… [+3830 chars]",
       "link": "https://gizmodo.com/scientists-find-fossilized-fish-that-may-have-been-blas-1833671176",
       "imageURL": "https://i.kinja-img.com/gawker-media/image/upload/s--k5igjW1P--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/kmh6cevl4e3pndtfhr9z.png"
  },
  {
       "title": "Emergency Exits Were Locked In Building Where 25 People Died From Fire, Officials Say - NPR",
       "summary": "\"This wasn't an accident; it's murder,\" Public Works and Housing Minister SM Rezaul Karim told reporters, blaming negligence for Thursday's deadly fire.",
       "publishedDate": "2019-03-29T18:18:00Z",
       "content": "At least 25 people died in a fire at a high-rise office building in Dhaka, Bangladesh, Thursday and officials say the building didn't have the right safety protocols in place. Mahmud Hossain Opu/AP The high-rise building where fire and smoke killed 25 people … [+2989 chars]",
       "link": "https://www.npr.org/2019/03/29/708068875/emergency-exits-were-locked-in-building-where-25-people-died-from-fire-officials",
       "imageURL": "https://media.npr.org/assets/img/2019/03/29/ap_19087343099291_wide-c12182f56a614d3477e33390e72dd1942efb9355.jpg?s=1400"
  },
  {
       "title": "Thousands of pro-Brexit protesters shut down Westminster on what should have been our independence day - The Sun",
       "summary": "Parliament Square was jam packed with passionate activists rallying for Brexit - who were furious that our official exit day has been scrapped",
       "publishedDate": "2019-03-29T18:17:26Z",
       "content": "THOUSANDS of pro-Brexit protesters have shut down Westminster this afternoon as they celebrated what should have been our independence day. Today Parliament Square was jam-packed with passionate activists rallying for Brexit - who were furious that our offici… [+4864 chars]",
       "link": "https://www.thesun.co.uk/news/brexit/8750077/thousands-of-pro-brexit-protesters-shut-down-westminster-on-what-should-have-been-our-independence-day/",
       "imageURL": "https://www.thesun.co.uk/wp-content/uploads/2019/03/RB-COMPOSITE-MARCH.jpg?strip=all&quality=100&w=1200&h=800&crop=1"
  },
  {
       "title": "US warns Russia, others against sending troops to Venezuela - Al Jazeera English",
       "summary": "White House adviser John Bolton accuses Nicolas Maduro is using foreign military personnel to stay in power.",
       "publishedDate": "2019-03-29T18:17:00Z",
       "content": "The White House on Friday warned Russia and other countries backing President Nicolas Maduro against sending troops and military equipment to Venezuela, saying the United States would view such actions as a \"direct threat\" to the region's security. The warnin… [+2522 chars]",
       "link": "https://www.aljazeera.com/news/2019/03/warns-russia-sending-troops-venezuela-190329135237891.html",
       "imageURL": "https://www.aljazeera.com/mritems/Images/2019/1/9/bd9721af4ec640e280f51191d19a660f_18.jpg"
  },
  {
       "title": "Kris Jenner Opens Up About Tristan Thompson, Jordyn Woods Scandal - E! Online",
       "summary": "E! star is speaking out about the controversy involving the basketball star and Kylie Jenner's BFF",
       "publishedDate": "2019-03-29T17:56:00Z",
       "content": "Earlier this week, E! News released a supertease for the upcoming Keeping Up With the Kardashians season, in which Khloe can be seen breaking down in tears over the scandal. \"It just sucks it has to be so public,\" the Good American co-founder cries in the vid… [+508 chars]",
       "link": "https://www.eonline.com/news/1028024/kris-jenner-reveals-how-her-family-coped-with-tristan-thompson-jordyn-woods-scandal",
       "imageURL": "https://akns-images.eonline.com/eol_images/Entire_Site/201859/rs_600x600-180609120556-rs_600x600-180218140141-600-khloe-kardashian-tristan-thompson.cm.6818.jpg?fit=around|600:467&crop=600:467;center,top&output-quality=90"
  },
  {
       "title": "Google parent company Alphabet has more than doubled its money on Lyft to $1 billion in just 17 months - CNBC",
       "summary": "Alphabet's CapitalG put $500 million in Lyft in late 2017 and is generating a big return to go along with its Uber investment.",
       "publishedDate": "2019-03-29T17:40:11Z",
       "content": "While Google parent company Alphabet pours capital into self-driving vehicles with its Waymo unit, the company is making real money in transportation right now. div &gt; div.group &gt; p:first-child\"&gt; CapitalG, the late-stage investing arm of Alphabet, has… [+1595 chars]",
       "link": "https://www.cnbc.com/2019/03/29/alphabet-has-more-than-doubled-its-money-on-lyft.html",
       "imageURL": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/06/11/102752279-larry-page.1910x1000.jpg"
  },
  {
       "title": "The Final Minutes of Ethiopian Airlines' Doomed Boeing 737 MAX - The Wall Street Journal",
       "summary": "New details of the crash of Ethiopian Airlines flight ET302 paint a picture of a catastrophic failure that quickly overwhelmed the flight crew. Investigators have preliminarily concluded that a Boeing automated flight-control feature activated before the plan…",
       "publishedDate": "2019-03-29T17:18:00Z",
       "content": "ADDIS ABABA, EthiopiaIt took less than six minutes to deepen one of the gravest crises in the history of Boeing Co. At 8:37 a.m. on March 10, Captain Yared Getachew and First Officer Ahmed Nur Mohammed were accelerating an Ethiopian Airlines Boeing 737 MAX al… [+89 chars]",
       "link": "https://www.wsj.com/articles/the-final-minutes-of-ethiopian-airlines-doomed-boeing-737-max-11553876300",
       "imageURL": "https://images.wsj.net/im-63308/social"
  },
  {
       "title": "MovieBob Reviews: 'Dumbo' - Geek",
       "summary": "The whole point of the Disney live-action remakes is basically another version of making a ride at one of their theme parks: “Remember that thing you like? Here’s an experience of it that’s …",
       "publishedDate": "2019-03-29T16:48:57Z",
       "content": "The whole point of the Disney live-action remakes is basically another version of making a ride at one of their theme parks: Remember that thing you like? Heres an experience of it thats slightly more tactile in some respect! The trick is that almost everyone… [+6120 chars]",
       "link": "https://www.geek.com/movies/moviebob-reviews-dumbo-1780726/",
       "imageURL": "https://www.geek.com/wp-content/uploads/2019/03/DUMBO-THUMB-1.jpg"
  },
  {
       "title": "Trump Threatens to Close Mexican Border Next Week Over Immigration - The New York Times",
       "summary": "“We will keep it stopped for a long time,” President Trump said in urging Mexico to stop all immigrants from illegally trying to enter the United States. “I’m not playing games.”",
       "publishedDate": "2019-03-29T16:34:03Z",
       "content": "Americans would feel the effects in other ways. Border control agencies are already reviewing ways to slow down immigration processing at the border. A senior Homeland Security official confirmed on Friday that shutting down ports of entry along the southwest… [+1626 chars]",
       "link": "https://www.nytimes.com/2019/03/29/us/politics/trump-mexico-illegal-immigration.html",
       "imageURL": "https://static01.nyt.com/images/2019/03/29/us/politics/29dc-TRUMP-01/29dc-TRUMP-01-facebookJumbo.jpg"
  },
  {
       "title": "Apple to shut down Texture on May 28th now that News+ exists - Engadget",
       "summary": "Apple is shutting down Texture as it transitions to News+, but what happens to readers with Android devices?",
       "publishedDate": "2019-03-29T16:31:28Z",
       "content": "Unlike when Apple closed Beats Music, there's currently no support for Android or Windows. You'll have to pick up an iOS device or Mac if you want to use News+ right now. And simply speaking, the likelihood of a subscriber buying an iPad or Mac just to keep s… [+540 chars]",
       "link": "https://www.engadget.com/2019/03/29/apple-to-shut-down-texture-may-28/",
       "imageURL": "https://o.aolcdn.com/images/dims?thumbnail=1200%2C630&quality=80&image_uri=https%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fcrop%3D1600%252C1066%252C0%252C0%26quality%3D85%26format%3Djpg%26resize%3D1600%252C1066%26image_uri%3Dhttps%253A%252F%252Fs.yimg.com%252Fos%252Fcreatr-uploaded-images%252F2019-03%252Fca1d4480-5239-11e9-b7eb-8cc8ce8a8bd1%26client%3Da1acac3e1b3290917d92%26signature%3D9191137d69b5e0de33f6616ea83e9904d33fe4ef&client=amp-blogside-v2&signature=a716b9fb4797884b7457e86fad1f2e4b535cdf4e"
  },
  {
       "title": "Texas AG investigating San Antonio for banning Chick-fil-A from its airport - CNN",
       "summary": "The Texas attorney general is investigating whether the city of San Antonio violated Chick-fil-A's religious liberty when it banned the fast food chain from its airport.",
       "publishedDate": "2019-03-29T16:18:23Z",
       "content": "The City of San Antonio's decision to exclude Chick-fil-A based on the religious beliefs associated with the company and its owners is the opposite of tolerance. It's discriminatory, and not only out of step with Texas values, but inconsistent with the Consti… [+90 chars]",
       "link": "https://www.cnn.com/2019/03/29/politics/texas-san-antonio-airport-chick-fil-a-investigation/index.html",
       "imageURL": "https://cdn.cnn.com/cnnnext/dam/assets/181022112535-03-chick-fil-a-delivery-catering-strategy-super-tease.jpg"
  },
  {
       "title": "Agnès Varda, mother of French New Wave cinema, dead aged 90 - CNN",
       "summary": "French film director Agnès Varda -- an icon of feminist cinema and the sole female director to emerge from the French New Wave of the 1960s -- has died at the age of 90, her family has confirmed.",
       "publishedDate": "2019-03-29T16:01:28Z",
       "content": "arts French film director Agnès Varda -- an icon of feminist cinema and the sole female director to emerge from the French New Wave of the 1960s -- has died at the age of 90, her family has confirmed. \"The director and artist Agnès Varda died at her home on t… [+3890 chars]",
       "link": "https://www.cnn.com/style/article/agnes-varda-french-filmmaker-dead-90-intl-scli/index.html",
       "imageURL": "http://cdn.cnn.com/cnnnext/dam/assets/190329114627-02-agnes-varda-file-2018-super-tease.jpg"
  },
  {
       "title": "Brexit vote today on Theresa May's European Union withdrawal agreement could lead to no-deal or long delay - Live updates - CBS News",
       "summary": "3 years after public referendum calling for divorce from EU, British lawmakers still can't agree on what it should look like",
       "publishedDate": "2019-03-29T15:36:00Z",
       "content": "London -- Friday was meant to be the day Britain formally ceased to be a member of the European Union. But three years after the public referendum calling for the divorce, the two sides appeared no closer to agreeing on an amicable separation. Even Britain ha… [+5801 chars]",
       "link": "https://www.cbsnews.com/news/brexit-vote-today-theresa-may-european-union-withdrawal-live-updates-29-03-2019/",
       "imageURL": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/03/29/bbc5bac7-5522-44bc-9b12-b61abce8dc81/thumbnail/1200x630/997c0898597d6098e72ba735a0e2661f/brexit-theresa-may.jpg"
  },
  {
       "title": "The 11-inch iPad Pro is on sale for $149 off at Amazon - Mashable",
       "summary": "You can also save $20 on Microsoft Office when you purchase the iPad Pro.",
       "publishedDate": "2019-03-29T15:26:00Z",
       "content": "Apple products seems to get sleeker and better-looking with each new model. The latest iPad Pro ditched the rounded exterior and home button and has edge-to-edge Liquid Retina display. Its essentially the iPhone X in tablet form. If youre itching to get your … [+1310 chars]",
       "link": "https://mashable.com/shopping/deal-march-29-ipad-pro-amazon/",
       "imageURL": "https://mondrian.mashable.com/2019%252F03%252F29%252F16%252Fa8aa66c77b0a48089a2a69218375f954.7bff5.png%252F1200x630.png?signature=DORAJxBQROqTW3dxB5muSLPCuBs="
  },
  {
       "title": "Here's Why Shares of RH Are Plunging on Friday - Motley Fool",
       "summary": "Uneasy consumers could shy away from big-ticket furniture purchases if the economy wobbles.",
       "publishedDate": "2019-03-29T15:17:00Z",
       "content": "What happened Shares of luxury home furnishing retailer RH ( NYSE:RH ) fell more than 17% on Friday morning after the company formerly known as Restoration Hardware warned that its full-year performance was unlikely to meet Wall Street expectations. So what A… [+1864 chars]",
       "link": "https://www.fool.com/investing/2019/03/29/heres-why-shares-of-rh-are-plunging-on-friday.aspx",
       "imageURL": "https://g.foolcdn.com/editorial/images/517695/market-crash-stock-broker-cartoon-source-getty.jpg"
  },
  {
       "title": "Sean Hayes makes a Jussie Smollett joke at GLAAD Media Awards - Page Six",
       "summary": "Sean Hayes received the Stephen F. Kolzak Award at the 30th GLAAD Media Awards.",
       "publishedDate": "2019-03-29T14:52:00Z",
       "content": "Allison Janney presented “Will &amp; Grace” star Sean Hayes with the Stephen F. Kolzak Award at the 30th GLAAD Media Awards and he was extremely grateful to receive the award so grateful that he didnt waste any time in throwing some shade. After saying he was… [+1593 chars]",
       "link": "https://pagesix.com/2019/03/29/sean-hayes-makes-a-jussie-smollett-joke-at-glaad-media-awards/",
       "imageURL": "https://nyppagesix.files.wordpress.com/2019/03/sean-hayes.jpg?quality=90&strip=all&w=1200"
  },
  {
       "title": "Deep Brain Stimulation For Depression, Mood Disorders Could Be Ethically Fraught : Shots - Health News - NPR",
       "summary": "Deep brain stimulation offers relief from some neurological problems and is being tested for mood disorders. But the treatment — an implant in the brain — raises ethical questions.",
       "publishedDate": "2019-03-29T14:28:00Z",
       "content": "Our thoughts and fears, movements and sensations all arise from the electrical blips of billions of neurons in our brain. Streams of electricity flow through neural circuits to govern these actions of the brain and body, and some scientists think that many ne… [+11824 chars]",
       "link": "https://www.npr.org/sections/health-shots/2019/03/29/707883163/are-we-ready-for-an-implant-that-can-change-our-moods",
       "imageURL": "https://media.npr.org/assets/img/2019/03/29/cc_mood_wide-6cb77ff06fe5b10734dd466fdf6e29c25101e2c6.jpg?s=1400"
  },
  {
       "title": "Watch: Kangaroo Rat Delivers a Ninja-Like Spinning Kick to Drop Rattlesnake - NBC Southern California",
       "summary": "High-speed video from researchers in Southern California reveals the surprising power of the a little desert rodent's reflexes and stunning combination of strength and agility.",
       "publishedDate": "2019-03-29T14:20:02Z",
       "content": "It's the classic predator-prey matchup. A stealthy rattlesnake, patiently waiting for the right moment to strike a seemingly unsuspecting and vulnerable kangaroo rat. But high-speed video from researchers in Southern California reveals the little desert roden… [+3039 chars]",
       "link": "https://www.nbclosangeles.com/news/local/Ninja-Kangaroo-Rat-Video-Rattlesnake-Venom-Attack-507832501.html",
       "imageURL": "https://media.nbclosangeles.com/images/1237*675/3-29-2019-rattlesnake-kangaroo-rat-kick-1.jpg"
  },
  {
       "title": "Angry over Brexit delay, 'Leave' supporters march through London - Reuters",
       "summary": "Thousands of people opposed to Britain delaying its departure from the European Union marched through central London on Friday as lawmakers in parliament strongly rejected Prime Minister Theresa May's Brexit deal for a third time.",
       "publishedDate": "2019-03-29T13:42:00Z",
       "content": "By Andrew MacAskill and Andrew R.C. Marshall LONDON (Reuters) - Thousands of people opposed to Britain delaying its departure from the European Union marched through central London on Friday as lawmakers in parliament strongly rejected Prime Minister Theresa … [+2897 chars]",
       "link": "https://www.reuters.com/article/uk-britain-eu-march/angry-over-brexit-delay-leave-supporters-march-through-london-idUSKCN1RA1K6",
       "imageURL": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190329&t=2&i=1371476496&w=1200&r=LYNXNPEF2S1IE"
  },
  {
       "title": "Virginia Tech vs. Duke odds: 2019 NCAA Tournament picks, Sweet 16 predictions from expert on 24-17 run - CBS Sports",
       "summary": "Kenny White has been crushing his college basketball picks",
       "publishedDate": "2019-03-29T13:42:00Z",
       "content": "Virginia Tech downed Duke in the regular season, but Zion Williamson didn't play. Now the Blue Devils get a chance at revenge when the ACC rivals face off in the 2019 NCAA Tournament Sweet 16. Tipoff on Friday night is at 9:40 p.m. ET in Washington D.C. The 5… [+3277 chars]",
       "link": "https://www.cbssports.com/college-basketball/news/virginia-tech-vs-duke-odds-2019-ncaa-tournament-picks-sweet-16-predictions-from-expert-on-24-17-run/",
       "imageURL": "https://sportshub.cbsistatic.com/i/r/2019/03/20/c6f7843c-fb98-437b-a5ce-99e7d65c4595/thumbnail/770x433/20bc36a95cab7b853ab3fab0517732bc/duke.jpg"
  },
  {
       "title": "Daimler Trucks buys a majority stake in self-driving tech company Torc Robotics - TechCrunch",
       "summary": "Daimler Trucks just announced that it’s acquiring a majority stake in Torc Robotics, a deal that will see the two companies collaborating on the development of Level 4 self-driving trucks. Daimler Trucks is the world’s largest truck manufacturer and a divisio…",
       "publishedDate": "2019-03-29T13:40:30Z",
       "content": "Daimler Trucks just announced that it’s acquiring a majority stake in Torc Robotics, a deal that will see the two companies collaborating on the development of Level 4 self-driving trucks. Daimler Trucks is the world’s largest truck manufacturer and a divisio… [+1647 chars]",
       "link": "https://techcrunch.com/2019/03/29/daimler-acquires-torc-robotics/",
       "imageURL": "https://techcrunch.com/wp-content/uploads/2019/03/unnamed-32.jpg?w=597"
  },
  {
       "title": "Hong Kong tourist falls to his death in Grand Canyon, second fatality in a week - AOL",
       "summary": "The 50-something aged man slipped off the Eagle Point overlook while taking photos, a spokesman for a local company, Grand Canyon West, told Reuters.",
       "publishedDate": "2019-03-29T13:30:21Z",
       "content": "A tourist from Hong Kong died on Thursday when he fell 1,000 feet into the Grand Canyon, the second person to die there in a week. The 50-something aged man slipped off the Eagle Point overlook while taking photos, a spokesman for a local company, Grand Canyo… [+2138 chars]",
       "link": "https://www.aol.com/article/news/2019/03/29/hong-kong-tourist-falls-to-his-death-in-grand-canyon/23702422/",
       "imageURL": "https://o.aolcdn.com/images/dims3/GLOB/crop/6769x4440+0+0/resize/1028x675!/format/jpg/quality/85/https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2019-03%2Fff7dfcc0-5232-11e9-bfbf-330801be2e1d"
  },
  {
       "title": "2019 NCAA Tournament Round 4: Purdue vs. Virginia Preview - Hammer and Rails",
       "summary": "Virginia is possibly the best team in America and a tall order for Purdue.",
       "publishedDate": "2019-03-29T13:00:00Z",
       "content": "Purdue is a game away from the Final Four. The last time this happened was my sophomore year in West Lafayette. We beat Dayton, Oklahoma, and Gonzaga in a classic broken bracket to be the higher seed in the regional final in Albuquerque. We faced off against … [+4908 chars]",
       "link": "https://www.hammerandrails.com/2019/3/29/18286609/2019-ncaa-tournament-purdue-virginia-preview-odds",
       "imageURL": "https://cdn.vox-cdn.com/thumbor/8lAg75o-qRIhUjcmrLDxJvf4lOI=/0x149:2518x1467/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15994435/usa_today_12434319.jpg"
  },
  {
       "title": "Teen who had seizures and groin pain turned out to have tapeworm brain infection, died after two weeks - ABC 12 News",
       "summary": "The unsettling case was reported in the New England Journal of Medicine, by two doctors, Nishanth Dev and S. Zafar Abbas, of the ESIC Medical College and Hopsital outside New Delhi.",
       "publishedDate": "2019-03-29T12:10:08Z",
       "content": "(Gray News) (03/29/19) - A teenager in India died two weeks after showing up at an emergency room with seizures and groin pain, appearing confused and with swelling over his eye, in what turned out to be symptoms of a parasitic brain disease caused by a tapew… [+1814 chars]",
       "link": "https://www.abc12.com/content/news/507826962.html",
       "imageURL": "https://media.graytvinc.com/images/CDC.JPG"
  },
  {
       "title": "Pet zebra escapes Florida home, is fatally shot by its owner - Fox News",
       "summary": "Authorities say a pet zebra escaped from a Florida home and was shot and killed by its owner, who wasn't licensed to own the animal.",
       "publishedDate": "2019-03-29T10:40:44Z",
       "content": "CALLAHAN, Fla. Authorities say a pet zebra escaped from a Florida home and was shot and killed by its owner, who wasn't licensed to own the animal. News outlets report the Nassau County Sheriff's Office says the zebra, named Shadow, injured itself somehow whi… [+457 chars]",
       "link": "https://www.foxnews.com/us/pet-zebra-escapes-florida-home-is-fatally-shot-by-its-owner",
       "imageURL": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png"
  },
  {
       "title": "DowDupont cuts its sales forecast as Midwest floods hit its agri division - CNBC",
       "summary": "DowDuPont cut its forecast for first-quarter sales on Thursday, citing the impact of U.S. Midwest floods on its agri business as well as weakness in its packaging and specialty plastics division.",
       "publishedDate": "2019-03-29T09:49:21Z",
       "content": "DowDuPont cut its forecast for first-quarter sales on Thursday, citing the impact of U.S. Midwest floods on its agri business as well as weakness in its packaging and specialty plastics division. Record floods have devastated a wide swath of the Farm Belt acr… [+1092 chars]",
       "link": "https://www.cnbc.com/2019/03/29/dowdupont-cuts-its-sales-forecast-as-midwest-floods-hit-its-agri-division.html",
       "imageURL": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2019/03/29/105821540-1553845575174ap_19087744317800.1910x1000.jpg"
  },
  {
       "title": "OPINION: Manu says goodbye to Spurs fans as only he could - WOAI",
       "summary": "In the end, it was a 55-minute celebration of the life and extremely entertaining times of Manu Ginobili, not the tearjerker many thought it might be given the emotional possibilities of the evening. Ginobili's famed No. 20 jersey will never be worn again in …",
       "publishedDate": "2019-03-29T05:02:15Z",
       "content": null,
       "link": "http://news4sanantonio.com/sports/spurs-zone/opinion-manu-says-goodbye-to-spurs-fans-as-only-he-could",
       "imageURL": "http://static-41.sinclairstoryline.com/resources/media/a27c9250-4a5f-4fcb-a423-85a3cc3fc9dd-large16x9_ManuGinobili.jpg?1553835404030"
  },
  {
       "title": "Trump foes not ready to give up on 'collusion' - Washington Examiner",
       "summary": "President Trump is claiming exoneration after special counsel Robert Mueller found no evidence he conspired with Russia. But Trump opponents aren’t ready to concede there was no “collusion” as they prepare to challenge the president in 2020.",
       "publishedDate": "2019-03-29T04:00:00Z",
       "content": "President Trump is claiming exoneration after special counsel Robert Mueller found no evidence he conspired with Russia. But Trump opponents arent ready to concede there was no collusion as they prepare to challenge the president in 2020. Without seeing the f… [+3689 chars]",
       "link": "https://www.washingtonexaminer.com/news/white-house/trump-foes-not-ready-to-give-up-on-collusion",
       "imageURL": "https://mediadc.brightspotcdn.com/dims4/default/bc40140/2147483647/strip/true/crop/2290x1202+0+60/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F3e%2Fff%2F0b573ae24defbe3d53563d95a172%2Fwhitehouse.jpg"
  },
  {
       "title": "HIV-Positive Kidney Donor Makes History - Baltimore, MD Patch",
       "summary": "A transplant this week at Johns Hopkins Hospital marked the first time in the world that someone with HIV could donate a kidney.",
       "publishedDate": "2019-03-29T01:24:51Z",
       "content": null,
       "link": "https://patch.com/maryland/baltimore/hiv-positive-kidney-donor-makes-history-report",
       "imageURL": "https://cdn20.patchcdn.com/users/57041/20190328/063633/styles/T800x600/public/processed_images/shutterstock_280947350-1553811572-4338.jpg"
  },
  {
       "title": "Border Officer’s Secret in Arizona: He Was Undocumented - The New York Times",
       "summary": "Marco A. De La Garza Jr. was an officer with Customs and Border Protection from 2012 to 2018. But his Texas birth certificate was fraudulent.",
       "publishedDate": "2019-03-28T23:35:29Z",
       "content": "Federal authorities also must field a work force that by design reflects the heavily Hispanic communities across the Southwest they are expected to police. Agents sometimes have relatives, friends and neighbors whom they know or suspect are undocumented. In S… [+2019 chars]",
       "link": "https://www.nytimes.com/2019/03/28/us/border-patrol-agent-undocumented-immigrant.html",
       "imageURL": "https://static01.nyt.com/images/2019/03/28/us/28agent-01/28agent-01-facebookJumbo.jpg"
  },
  {
       "title": "Our mysterious cousins—the Denisovans—may have mated with modern humans as recently as 15000 years ago - Science Magazine",
       "summary": "Genomic data from New Guineans suggest late mixing of archaic group with modern humans",
       "publishedDate": "2019-03-28T20:50:07Z",
       "content": "Some of the last Denisovans may have intermingled with modern humans in mountainous New Guinea or on nearby islands. DOZIER MARC/hemis.fr/Getty Images By Ann Gibbons Mar. 29, 2019, 10:30 AM CLEVELAND, OHIO The elusive Denisovans, the extinct cousins of Neande… [+4958 chars]",
       "link": "https://www.sciencemag.org/news/2019/03/our-mysterious-cousins-denisovans-may-have-mated-modern-humans-recently-15000-years-ago",
       "imageURL": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/png_16x9.jpg?itok=JU2ZMVz1"
  },
  {
       "title": "Rabalais: LSU has crossed that unwritten bar of reaching the Sweet 16; Can the Tigers go further? - The Advocate",
       "summary": "WASHINGTON — Back at preseason media day, long before his current problems turned from a simmer to a boil, LSU basketball coach Will Wade stood off to the side during",
       "publishedDate": "2019-03-28T20:30:00Z",
       "content": "WASHINGTON Back at preseason media day, long before his current problems turned from a simmer to a boil, LSU basketball coach Will Wade stood off to the side during player interviews, chatting about what kind of team his Tigers could become. His prediction, l… [+5032 chars]",
       "link": "https://www.theadvocate.com/baton_rouge/sports/lsu/article_7d996bea-5197-11e9-8a7a-3b67127a9d17.html",
       "imageURL": "https://bloximages.newyork1.vip.townnews.com/theadvocate.com/content/tncms/assets/v3/editorial/f/21/f21d9ea3-56a8-5889-94eb-d6aa1fdbcb04/5c9c08b6cd059.image.jpg?resize=630%2C630"
  },
  {
       "title": "Samsung Galaxy S10 Review - IGN",
       "summary": "Samsung's all-new Galaxy S10 smartphone offers a lot of fancy features and a gorgeous design with just a few quirks.",
       "publishedDate": "2019-03-28T17:20:01Z",
       "content": "Samsungs funky new flagship shines. By Nic Vargus Note that if you click on one of these links to buy the product, IGN may get a share of the sale. For more, read our Terms of Use. What makes a Galaxy phone a, well, Galaxy phone? Up until recently, I didnt ha… [+9173 chars]",
       "link": "https://www.ign.com/articles/2019/03/28/samsung-galaxy-s10-review",
       "imageURL": "https://assets1.ignimgs.com/2019/03/28/s10phone-blogroll-1553792976496_1280w.jpg"
  },
  {
       "title": "Arizona officers storm house with guns drawn over toddler with a fever - AOL",
       "summary": "Sarah Beck and Brooks Bryce brought their feverish 2-year-old son to a clinic in late February and were told he had a temperature of 105.",
       "publishedDate": "2019-03-28T16:16:15Z",
       "content": "Police with guns drawn broke down the door of an Arizona home and ordered three children into the custody of the Department of Child Safety because the parents had refused to take their son with a fever to the hospital. Sarah Beck and Brooks Bryce brought the… [+2828 chars]",
       "link": "https://www.aol.com/article/news/2019/03/28/arizona-officers-storm-house-with-guns-drawn-over-toddler-with-a-fever/23701982/",
       "imageURL": "https://o.aolcdn.com/images/dims3/GLOB/crop/565x371+1+0/resize/1028x675!/format/jpg/quality/85/https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2019-03%2Fae3d9b40-5174-11e9-bfdb-9f660310ea7f"
  },
  {
       "title": "Measles: Few attend first free vaccination clinic since Rockland declared state of emergency - The Journal News | LoHud.com",
       "summary": "The free vaccination clinic given by the county had almost as many reporters and photographers as people who came in to get the vaccine.",
       "publishedDate": "2019-03-27T22:29:00Z",
       "content": "County Attorney Humbach and Commissioner of Health Schnabel Ruppert offer comments at vaccination clinic John Meore, jmeore@lohud.com RAMAPO - Only 30 people attended a free vaccination clinic less than 24 hours after a state of emergency was declared banning… [+7990 chars]",
       "link": "https://www.lohud.com/story/news/local/rockland/new-hempstead/2019/03/27/measles-free-vaccination-clinic-rockland/3288643002/",
       "imageURL": "https://www.gannett-cdn.com/presto/2019/03/27/PWES/ec24b99d-6d0e-4f93-953d-18d27b5dd6e6-jm032719_Vaccination19.JPG?crop=3599,2024,x0,y235&width=3200&height=1680&fit=bounds"
  }
]
